---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ElectricalAnalyticalNode
source: html/cdb70bbc-c78d-bafe-4e70-5a1aa2052d56.htm
---
# ElectricalAnalyticalNode Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.